reports/report_pgbench.txt
pgbench (16.9 (Ubuntu 16.9-0ubuntu0.24.04.1))
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 4
maximum number of tries: 1
number of transactions per client: 10000
number of transactions actually processed: 500000/500000
number of failed transactions: 0 (0.000%)
latency average = 11.026 ms
initial connection time = 122.409 ms
tps = 4534.882991 (without initial connection time)
pgbench (16.9 (Ubuntu 16.9-0ubuntu0.24.04.1))
transaction type: query.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 16
maximum number of tries: 1
number of transactions per client: 10000
number of transactions actually processed: 500000/500000
number of failed transactions: 0 (0.000%)
latency average = 11.096 ms
initial connection time = 105.862 ms
tps = 4506.135198 (without initial connection time)
pgbench (16.9 (Ubuntu 16.9-0ubuntu0.24.04.1))
transaction type: complex_query.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 12
maximum number of tries: 1
number of transactions per client: 10000
number of transactions actually processed: 500000/500000
number of failed transactions: 0 (0.000%)
latency average = 5.726 ms
initial connection time = 130.959 ms
tps = 8732.408628 (without initial connection time)